const questions = [
  {
    id: '1',
    title: 'Из какого фильма Прекрасный принц?',
    variants: ['Золушка', 'Русалочка', 'Спящая красавица', 'Мулан'],
    correct: 0,
    details: 'У прекрасного принца нет имени.',
  },
  {
    id: '2',
    title: 'Какой герой мультфильма живет в ананасе под водой?',
    variants: ['Камбала', 'Немо', 'Рик и Морти', 'Спанч Боб Квадратные Штаны'],
    correct: 3,
    details:
      'Губка Боб Квадратные Штаны - американский мультипликационный персонаж, созданный преподавателем морских наук и аниматором Стивеном Хилленбургом для компании Nickelodeon.',
  },
  {
    id: '3',
    title: 'Какая страна производит больше всего кофе в мире?',
    variants: ['Колумбия', 'Индонезия', 'Бразилия', 'Вьетнам'],
    correct: 2,
    details: 'Бразилия производит около трети всего кофе в мире.',
  },
  {
    id: '4',
    title: 'Какой вкус у Куантро?',
    variants: ['Базилика', 'Лимона', 'Ванили', 'Апельсина'],
    correct: 3,
    details:
      'Куантро - это ликер с апельсиновым вкусом, который впервые был продан в 1875 году.',
  },
  {
    id: '5',
    title: 'Как называется колокол часов Вестминстерского дворца в Лондоне?',
    variants: ['Биг Бен', 'Броненосец', 'Калабаш', 'Мумия'],
    correct: 0,
    details: 'Ночью циферблат часов и колокольня Биг-Бена подсвечиваются.',
  },
  {
    id: '6',
    title: 'Из чего сделан самый крепкий дом в “Трех поросятах”?',
    variants: ['Глина', 'Газобетон', 'Кирпич', 'Бамбук'],
    correct: 2,
    details:
      'В оригинальной истории лиса пыталась попасть в дом из кирпичей через дымоход, но упала в горячую воду и ошпарилась насмерть.',
  },
];

export default questions;
